Version2/TestTool-Fosters/TestTool.Setup/Requests/DeviceMngmt/SetNetworkProtocolsRequest/TC.DM.NVT.15_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetNetworkProtocols>
      <tds:NetworkProtocols>
        <tt:Name>RTSP</tt:Name>
        <tt:Enabled>true</tt:Enabled>
        <tt:Port>RTSP_PORT</tt:Port>
      </tds:NetworkProtocols>
    </tds:SetNetworkProtocols>
  </soap:Body>
</soap:Envelope>